m_500/0.orig/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];



internalField uniform (0 0 0);

boundaryField
{
     inlet
    {
        type            fixedValue;
        value           uniform (0.1125 0 0 ); //G=1000kg/m2*s -->89.55kg/
    }
    
    outlet
    {
        type            zeroGradient;
        
    }
    
    heater
    {
        
        type            noSlip;
    }
    topWall
    {
        type            noSlip;
    }
    "pin.*|Pin.*"
    {
        type            noSlip;
    }
    
    "(rightWall|leftWall)"
    {
        type           cyclic;       
    }
}


// ************************************************************************* //
