m_500/0.orig/fluid/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value          uniform 1;
    }

    outlet
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    heater
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          5;
        value           uniform 1;
    }
    topWall
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          5;
        value           uniform 1;
    }
    "pin.*|Pin.*"
    {
        type            constantAlphaContactAngle;
        gradient        uniform 0;
        limit           gradient;
        theta0          5;
        value           uniform 1;
    }

    "(rightWall|leftWall)"
    {
        type           cyclic;
    }


}



// ************************************************************************* //
