m_500/system/fluid/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../simSetup"

convertToMeters 1;

vertices        
(
    (0 0 0) // 0
    ($L 0 0) //1
    ($L $H 0) // 2
    (0 $H 0) // 3
    (0 0 $W) // 4
    ($L 0 $W) // 5
    ($L $H $W) // 6
    (0 $H $W) //7

);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);


edges           
(
);

boundary
(

     topWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    
    heater
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }

     leftWall
    {
        type cyclic;
        neighbourPatch  rightWall;
        faces
        (
            (3 7 6 2)
        );
    }
    rightWall
    {
        type cyclic;
        neighbourPatch  leftWall;
        faces
        (
            (1 5 4 0)
        );
    }
    
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

);

mergePatchPairs 
(
);

// ************************************************************************* //
