m_500/system/fluid/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  24;

/*
    Main methods are:
    1) Geometric: "simple"; "hierarchical", with ordered sorting, e.g. xyz, yxz
    2) Scotch: "scotch", when running in serial; "ptscotch", running in parallel
*/

method             simple;
//method             scotch;

simpleCoeffs
{
    n               (4 3 2); // total must match numberOfSubdomains
    
}



// ************************************************************************* //
