m_500/system/fluid/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../simSetup"
convertToMeters 1;
// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       true;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface

geometry
{

  Pin.0_2
    {
        type searchableCylinder;
        point1 (#calc "$Dx*2" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*2" #calc "$Dy/2" 1);
        radius $Rpin;
    }

    pin.0_3
    {
        type searchableCylinder;
        point1 (#calc "$Dx*3" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*3"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_4
    {
        type searchableCylinder;
        point1 (#calc "$Dx*4" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*4"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_5
    {
        type searchableCylinder;
        point1 (#calc "$Dx*5" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*5" #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_6
    {
        type searchableCylinder;
        point1 (#calc "$Dx*6" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*6" #calc "$Dy/2" 1);
        radius $rpin;
    }

        pin.0_7
    {
        type searchableCylinder;
        point1 (#calc "$Dx*7" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*7" #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_8
    {
        type searchableCylinder;
        point1 (#calc "$Dx*8" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*8"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_9
    {
        type searchableCylinder;
        point1 (#calc "$Dx*9" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*9"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_10
    {
        type searchableCylinder;
        point1 (#calc "$Dx*10" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*10" #calc "$Dy/2" 1);
        radius $rpin;
    }
    
     pin.0_11
    {
        type searchableCylinder;
        point1 (#calc "$Dx*11" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*11" #calc "$Dy/2" 1);
        radius $rpin;
    }
    
    pin.0_12
    {
        type searchableCylinder;
        point1 (#calc "$Dx*12" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*12"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_13
    {
        type searchableCylinder;
        point1 (#calc "$Dx*13" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*13"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_14
    {
        type searchableCylinder;
        point1 (#calc "$Dx*14" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*14" #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_15
    {
        type searchableCylinder;
        point1 (#calc "$Dx*15" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*15" #calc "$Dy/2" 1);
        radius $rpin;
    }

        pin.0_16
    {
        type searchableCylinder;
        point1 (#calc "$Dx*16" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*16" #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_17
    {
        type searchableCylinder;
        point1 (#calc "$Dx*17" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*17"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_18
    {
        type searchableCylinder;
        point1 (#calc "$Dx*18" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*18"  #calc "$Dy/2" 1);
        radius $rpin;
    }

    pin.0_19
    {
        type searchableCylinder;
        point1 (#calc "$Dx*19" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*19" #calc "$Dy/2" 1);
        radius $rpin;
    }
    
     pin.0_20
    {
        type searchableCylinder;
        point1 (#calc "$Dx*20" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*20" #calc "$Dy/2" 1);
        radius $rpin;
    }

     pin.0_21
    {
        type searchableCylinder;
        point1 (#calc "$Dx*21" #calc "$Dy/2" -1);
        point2 (#calc "$Dx*21" #calc "$Dy/2" 1);
        radius $rpin;
    }


/*
    Pin.1_2
    {
        type searchableCylinder;
        point1 (#calc "$Dx*2" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*2" #calc "$Dy/2+$Dy" 1);
        radius $Rpin;
    }

    pin.1_3
    {
        type searchableCylinder;
        point1 (#calc "$Dx*3" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*3" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_4
    {
        type searchableCylinder;
        point1 (#calc "$Dx*4" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*4" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_5
    {
        type searchableCylinder;
        point1 (#calc "$Dx*5" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*5" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_6
    {
        type searchableCylinder;
        point1 (#calc "$Dx*6" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*6" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }



         pin.1_7
    {
        type searchableCylinder;
        point1 (#calc "$Dx*7" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*7" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_8
    {
        type searchableCylinder;
        point1 (#calc "$Dx*8" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*8"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_9
    {
        type searchableCylinder;
        point1 (#calc "$Dx*9" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*9"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_10
    {
        type searchableCylinder;
        point1 (#calc "$Dx*10" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*10" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }
    
     pin.1_11
    {
        type searchableCylinder;
        point1 (#calc "$Dx*11" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*11" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }
    
    pin.1_12
    {
        type searchableCylinder;
        point1 (#calc "$Dx*12" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*12"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_13
    {
        type searchableCylinder;
        point1 (#calc "$Dx*13" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*13"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_14
    {
        type searchableCylinder;
        point1 (#calc "$Dx*14" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*14" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_15
    {
        type searchableCylinder;
        point1 (#calc "$Dx*15" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*15" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

        pin.1_16
    {
        type searchableCylinder;
        point1 (#calc "$Dx*16" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*16" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_17
    {
        type searchableCylinder;
        point1 (#calc "$Dx*17" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*17"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_18
    {
        type searchableCylinder;
        point1 (#calc "$Dx*18" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*18"  #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }

    pin.1_19
    {
        type searchableCylinder;
        point1 (#calc "$Dx*19" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*19" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }
    
     pin.1_20
    {
        type searchableCylinder;
        point1 (#calc "$Dx*20" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*20" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }
    
     pin.1_21
    {
        type searchableCylinder;
        point1 (#calc "$Dx*21" #calc "$Dy/2+$Dy" -1);
        point2 (#calc "$Dx*21" #calc "$Dy/2+$Dy" 1);
        radius $rpin;
    }
    
    /*
    Pin.2_2
    {
        type searchableCylinder;
        point1 (#calc "$Dx*2" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*2" #calc "$Dy/2+$Dy*2" 1);
        radius $Rpin;
    }

    pin.2_3
    {
        type searchableCylinder;
        point1 (#calc "$Dx*3" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*3" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_4
    {
        type searchableCylinder;
        point1 (#calc "$Dx*4" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*4" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_5
    {
        type searchableCylinder;
        point1 (#calc "$Dx*5" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*5" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_6
    {
        type searchableCylinder;
        point1 (#calc "$Dx*6" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*6" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }



         pin.2_7
    {
        type searchableCylinder;
        point1 (#calc "$Dx*7" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*7" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_8
    {
        type searchableCylinder;
        point1 (#calc "$Dx*8" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*8"  #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_9
    {
        type searchableCylinder;
        point1 (#calc "$Dx*9" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*9"  #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }

    pin.2_10
    {
        type searchableCylinder;
        point1 (#calc "$Dx*10" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*10" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }
    
     pin.2_11
    {
        type searchableCylinder;
        point1 (#calc "$Dx*11" #calc "$Dy/2+$Dy*2" -1);
        point2 (#calc "$Dx*11" #calc "$Dy/2+$Dy*2" 1);
        radius $rpin;
    }
    
    Pin.3_2
    {
        type searchableCylinder;
        point1 (#calc "$Dx*2" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*2" #calc "$Dy/2+$Dy*3" 1);
        radius $Rpin;
    }

    pin.3_3
    {
        type searchableCylinder;
        point1 (#calc "$Dx*3" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*3" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_4
    {
        type searchableCylinder;
        point1 (#calc "$Dx*4" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*4" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_5
    {
        type searchableCylinder;
        point1 (#calc "$Dx*5" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*5" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_6
    {
        type searchableCylinder;
        point1 (#calc "$Dx*6" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*6" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }



         pin.3_7
    {
        type searchableCylinder;
        point1 (#calc "$Dx*7" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*7" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_8
    {
        type searchableCylinder;
        point1 (#calc "$Dx*8" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*8"  #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_9
    {
        type searchableCylinder;
        point1 (#calc "$Dx*9" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*9"  #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }

    pin.3_10
    {
        type searchableCylinder;
        point1 (#calc "$Dx*10" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*10" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }
    
     pin.3_11
    {
        type searchableCylinder;
        point1 (#calc "$Dx*11" #calc "$Dy/2+$Dy*3" -1);
        point2 (#calc "$Dx*11" #calc "$Dy/2+$Dy*3" 1);
        radius $rpin;
    }
*/
};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 10000000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 20000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 10;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.10;


    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 8;  //used to be 3



    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
	"pin.*"
        {
            // Surface-wise min and max refinement level
            level (0 0);

        }
        "Pin.*"
        {
            // Surface-wise min and max refinement level
            level (0 0);

        }

    }

    // Resolve sharp angles
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        solid
        {
            // Surface-wise min and max refinement level
            mode inside;
            levels ((1 1));

        }
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (1e-6 1e-6  1e-6);/*(168 -225 -26) ;*/
   /* locationsInMesh
      (
     ((0 0 0) solid)
     ((1e-6 1e-6  1e-6) fluid));
*/
    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    //- Number of patch smoothing iterations before finding correspondence
    //  to surface
    nSmoothPatch 9;

    //- Relative distance for points to be attracted by surface feature point
    //  or edge. True distance is this factor times local
    //  maximum edge length.
    tolerance 8.0;

    //- Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    //- Maximum number of snapping relaxation iterations. Should stop
    //  before upon reaching a correct mesh.
    nRelaxIter 3;

    // Feature snapping
	/*
        //- Number of feature edge snapping iterations.
        //  Leave out altogether to disable.
        nFeatureSnapIter 10;

        //- Detect (geometric only) features by sampling the surface
        //  (default=false).
        implicitFeatureSnap false;

        //- Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        //- Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap false;
	*/
}



// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Per final patch (so not geometry!) the layer information
    layers
    {
        "pin.*"
        {
            nSurfaceLayers 5;
        }
        "Pin.*"
        {
            nSurfaceLayers 5;
        }


    }

    // Expansion factor for layer mesh
    expansionRatio 2;

    // Wanted thickness of final added cell layer. If multiple layers
    // is the thickness of the layer furthest away from the wall.
    // Relative to undistorted size of cell outside layer.
    // See relativeSizes parameter.
    finalLayerThickness 0.8;

    // Minimum thickness of cell layer. If for any reason layer
    // cannot be above minThickness do not add layer.
    // Relative to undistorted size of cell outside layer.
    minThickness 0.01;

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 50;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 10;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;


    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;


    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    #include "meshQualityDict"


    //- Number of error distribution iterations    -------- ADDED FOR OF4
    nSmoothScale 4;

    //- Amount to scale back displacement at error points    -------- ADDED FOR OF4
    errorReduction 0.75;
}


// Advanced

// Write flags
writeFlags
(
    scalarLevels
    layerSets
    layerFields     // write volScalarField for layer coverage
);


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
