m_500/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.bubble 0
);

regions
(
    sphereToCell
    {
        centre (5.140000000000000e-04 0 0);
	radius 2.313e-04;
	
        fieldValues
        (
            volScalarFieldValue alpha.bubble 1
        );
    }
    
    sphereToCell
    {
        centre (0.005654000000000 0 0);
	radius 2.313e-04;
	
        fieldValues
        (
            volScalarFieldValue alpha.bubble 1
        );
    }
  
    cylinderToCell
    {
        p1 (5.140000000000000e-04 0 0);
        p2 (0.005654000000000 0 0);
	radius 2.313e-04;
        fieldValues
        (
            volScalarFieldValue alpha.bubble 1
        );
    }
  
);


// ************************************************************************* //
