m_500/system/simSetup
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Flow conditions */
//Ca 0.03; // mul*Ul/sigma
//Re 1.0; // rhol*Ul*D/mul
//densityRatio 1000.0; // rhol/rhog
//viscosityRatio 100.0; // mul/mug

Ul 1.0; //  liquid inlet velocity - hardcoded
rhol 1.0; // liquid density - hardcoded

/* geometry/mesh */
np_x 5;  //number of small pin in x
np_y 5;  //number of small pin in y
Np_x 20;  //number of big pin in x
Np_y 1;  //number of big pin in y
s 3;  //space of void (no cylinders)


rpin 25e-6;  //radius small pin
Rpin 50e-6;
Dx 91.7e-6;   //distance big pin centres in x
Dy 150e-6;   //distance big pin centres in y

L #calc "$Dx*($Np_x+$s)";
W  100e-6;
H #calc "$Dy*($Np_y)";



nyForRpin 10;
nx  633;//500;
ny 45;//204
nz 30;//34

//Co 0.1; // Courant number

/* Initial bubble: a rod of length Lb with spherical caps of radius Rb */
